<template lang="pug">
  .home
    h1(class='home__title') Покров Пресвете Богородице

    img(src='../assets/images/content-img/home/holymother.webp' class='home__img' alt="Holy Mother image")

    .home__content
      p(class='home__content--text')
        strong(class='home__content--text--lead') Покров Пресвете Богородице

        |  је хришћански црквени празник када црква прославља Пресвету Богородицу као покровитељку и заштитницу хришћанскога рода.

      p(class='home__content--text') Конкретан догађај који се тога дана спомиње и празнује десио се према хришћанском вјеровању 1. октобра 911. године у време цара Лава Мудрога (или Философа). Служенно је свеноћно бдење у Богородичиној цркви Влахерне у Цариграду. Црква је била пуна народа.

      p(class='home__content--text')  У позадини цркве стајао је свети Андреј Јуродиви са својим учеником Епифанијем. Према хришћанском вјеровању, у четврти сат ноћи појавила се Пресвета Богородица изнад народа са распростртим омофором на рукама, као да том одећом покрива народ.

      p(class='home__content--text') Била је обучена у златокрасну порфиру и сва је блистала у неисказаном сјају, окружена апостолима, светитељима, мученицима и девицама.

      p(class='home__content--text') Свети Андреј видећи то јављање показао је руком Епифанију блаженом, и упитао га: „видиш ли, брате, Царицу и госпођу над свим, како се моли за сав свет?" Одговори Епифаније: „видим, оче, и ужасавам се!".
</template>

<script>

export default {
  name: 'home',
  components: {
  }
}
</script>
