import Vue from 'vue';
import Vuex from 'vuex';

Vue.use(Vuex);

export default new Vuex.Store({
  state: {

    currentYear: new Date().getFullYear(),
    currentMonth: new Date().getMonth() + 1,
    imagePath: '../assets/images/gallery/',
    navLinks: [
      {
        name: 'Насловна',
        path: '/',
      },
      {
        name: 'Свештенство',
        path: '/svestenstvo'
      },
      {
        name: 'Календар',
        path: '/pravoslavni-kalendar'
      },
      {
        name: 'Галерија',
        path: '/galerija'
      },
      {
        name: 'Контакт',
        path: '/kontakt'
      },
      {
        name: 'Историјат Храма',
        path: '/istorijat-hrama'
      },
      {
        name: 'Историјат Града',
        path: '/istorijat-grada'
      },
      {
        name: 'Распоред богослужења',
        path: '/raspored-bogosluzenja'
      },
      {
        name: 'Видео Садржај',
        path: '/mediavideo'
      }
    ],

    usefulLinks: [
      {
        name: 'Православно Хришћанство',
        path: 'http://www.pravoslavno-hriscanstvo.com/'
      },
      {
        name: 'Дигитални Хиландар',
        path: 'https://riznica.hilandar.org/'
      }
    ],

    months: [
      {
        name: 'Мјесец',
        value: 'null'
      },
      {
        name: 'Јануар',
        value: 1
      },
      {
        name: 'Фебруар',
        value: 2
      },
      {
        name: 'Март',
        value: 3
      },
      {
        name: 'Април',
        value: 4
      },
      {
        name: 'Мај',
        value: 5
      },
      {
        name: 'Јуни',
        value: 6
      },
      {
        name: 'Јули',
        value: 7
      },
      {
        name: 'Август',
        value: 8
      },
      {
        name: 'Септембар',
        value: 9
      },
      {
        name: 'Октобар',
        value: 10
      },
      {
        name: 'Новембар',
        value: 11
      },
      {
        name: 'Децембар',
        value: 12
      },
    ],

    priestsBios: [
      {
        name: 'Петар Петрић',
        title: 'Протојереј',
        job: 'Старијешина Храма',
        bio: 'Лорем ипсум долор сит амет, ат ноструд цонсецтетуер цум. Не меа нусяуам евертитур перципитур, пер ат пробо путант перципитур. Еос лабитур фастидии адиписци ид. Вим еу фацилисис патриояуе. Ат вим иисяуе сцрипсерит репрехендунт. Иус стет еурипидис не, цум витае дицам фацилисис еу. Цу сед неморе епицури цонцептам. Еи тимеам еяуидем хис, еу мел бонорум ехпетендис сцрипторем. Ат мазим либер нам, идяуе децоре фабеллас яуи но.',
        spouse: 'Милена Максимовић рођ. Лукић',
        children: 'Јелена (12), Милош (10), Миланка (8)',
        saint: 'Часне вериге Св. апостола Петра',
        phone: '065/555-333',
        email: 'petar@gmail.com',
        image: 'https://www.gravatar.com/avatar/00000000000000000000000000000000?d=mp&f=y&s=100'
      },
      {
        name: 'Марко Марковиц',
        title: 'Јереј',
        job: '',
        bio: 'Лорем ипсум долор сит амет, ат ноструд цонсецтетуер цум. Не меа нусяуам евертитур перципитур, пер ат пробо путант перципитур. Еос лабитур фастидии адиписци ид. Вим еу фацилисис патриояуе. Ат вим иисяуе сцрипсерит репрехендунт. Иус стет еурипидис не, цум витае дицам фацилисис еу. Цу сед неморе епицури цонцептам. Еи тимеам еяуидем хис, еу мел бонорум ехпетендис сцрипторем. Ат мазим либер нам, идяуе децоре фабеллас яуи но.',
        spouse: 'Милена Максимовић рођ. Лукић',
        children: 'Јелена (12), Милош (10), Миланка (8)',
        saint: 'Свети Николај Мирликијски Чудотворац',
        phone: '065/777-222',
        email: 'marko@gmail.com',
        image: 'https://www.gravatar.com/avatar/00000000000000000000000000000000?d=mp&f=y&s=100'
      }
    ],

    cityHistoricalDatas: [

      {
        title: 'Први Записи',
        images: [],
        texts: [
          'Градишка се, према писаним документима, први пут помиње прије нешто више од 700 година и то под називом Градишки Брод. Међутим, живот на просторима садашњег града, у ближој и широј околини, датира још од праисторијског доба.',
          'У доба Римљана на мјесту садашњег града налазило се насеље Municipium Servitium (Serbinum), које је било важна раскрсница путева према истоку и југу Балкана, односно пристаниште за ријечну римску флоту, што довољно говори о стратешком значају насеља у то вријеме.',
          'Најстарији документован податак о српском имену датира из 69. или 75. хе у познатој књизи Плинија Млађег "Познавање природе" гдје наилазимо на српско име у латинизованом облику — Серби. Он дословно каже: "A Cimmerio accolunt Maeotici, Vali, Serbi, Zingi, Psesii" (Поред Кимерана станују Меотици, Вали, Срби, Зинги, Псеси).',
          'Топографија тла на коме се српски етнички први пут јасно именује јесте сјевероисточно од Босфора код Кимерана, Сармата и Међана. Читав вијек послије овог Плинијевог навода (најкасније 175), наилазимо на помен српског имена у дијелу Географија великог египатског научника који је своја дијела писао на старогрчком језику, Клаудија Птолемеја: Између Кераунског планинског вијенца и ријеке Ра смештени су Оринеји и Вали и Срби. Поред овог антропогеографског податка по коме племе Срба насељава подручје Закавказја у понтском залеђу, он даје још значајнији податак да у Панонији постоји и град-насеље који се назива Сербин). Овај „Српски град“ или „Србица“ убележен је на његовој мапи Доње Паноније или Подунавских регија негдје у савском порјечју, на месту данашње Градишке, или је могуће чак да иде и северозападније до Сиска и Загреба. Постојање имена мјеста које је свој топоним добило, очигледно према народу који у њему живи, прворазредно је сведочанство како то није могла да оствари нека случајна племенска заједница која се ту затекла, или неки новопридошли елемент у Панонију без одговарајућих карактеристика народа са културним идентитетом, који се прије свега огледа у самосвесном ношењу властитог имена.'
        ]
      },

      {
        title: 'Угарски период',
        images: [
          {
            name: 'Vrbaskigrad.webp',
            caption: 'Средњовјековни град из угарског периода код Горњих Подградаца'
          }
        ],
        texts: [
          'У средњем вијеку Градишка се налазила у саставу Угарског краљевства.',
          'Угарска је овим подручјем владала преко 400. година, од 1102. године, када је Хрватска и Славонија у чијем се саставу налазила и Градишка ушла у персоналну унију са Угарском, па до 1537. године. Подручје града припадало је Жупи Врбас (Orbasz). Око 1330. године Градишка се помиње као слободна варош. У средњем вијеку Градишка је имала велики значај као мјесто прелаза преко ријеке Саве.',
          'За угарске владавине у сачуваним документима и на ондашњим географским картама осим Градишке спомињу се још и градови (насеља) Врбашки град и Ливач, по којем је Лијевче Поље и добило назив. Не може се са сигурношћу утврдити положај ова два насеља. За Врбашки град неки историчари тврде да је у питању Бања Лука, док с друге стране постоји могућност да се ово средњовјековно насеље налазило на једној узвисини изнад Горњих Подградаца гдје су и данас видљиви остаци утврђења, темељи цркве и старо гробље. У прилог овоме иде и чињеница да је Врбашки кнез убирао приходе од трговине на прелазу преко Саве код Градишке, а самог кнеза бирали су чиновници са угарског двора. Био је то кнежевски град, сједиште жупаније а касније и врбашког дистрикта.',
          'У писаним историјским документима се сједиште жупе Врбас — Врбашки град, изричито спомиње 1293. године. Он се спомиње и као краљевски град. Врбашки град се помиње 1321. године када је издата повеља под градом Врбасом и 1398. године када је под овим градом боравио мађарско-аустријски краљ и будући њемачки цар Сигисмунд.'
        ]
      },

      {
        title: 'Отомански период',
        images: [
          {
            name: 'GradiskaBerbir.webp',
            caption: 'Градишка 17. вијеку'
          },
          {
            name: 'Gradiska1789.webp',
            caption: 'Битка за Градишку, 1789. године, Аустријско-турски рат (1787-1791)'
          }
        ],
        texts: [
          'У средњем вијеку Градишка се налазила у саставу Угарског краљевства.',
          'Угарска је овим подручјем владала преко 400. година, од 1102. године, када је Хрватска и Славонија у чијем се саставу налазила и Градишка ушла у персоналну унију са Угарском, па до 1537. године. Подручје града припадало је Жупи Врбас (Orbasz). Око 1330. године Градишка се помиње као слободна варош. У средњем вијеку Градишка је имала велики значај као мјесто прелаза преко ријеке Саве.',
          'За угарске владавине у сачуваним документима и на ондашњим географским картама осим Градишке спомињу се још и градови (насеља) Врбашки град и Ливач, по којем је Лијевче Поље и добило назив. Не може се са сигурношћу утврдити положај ова два насеља. За Врбашки град неки историчари тврде да је у питању Бања Лука, док с друге стране постоји могућност да се ово средњовјековно насеље налазило на једној узвисини изнад Горњих Подградаца гдје су и данас видљиви остаци утврђења, темељи цркве и старо гробље. У прилог овоме иде и чињеница да је Врбашки кнез убирао приходе од трговине на прелазу преко Саве код Градишке, а самог кнеза бирали су чиновници са угарског двора. Био је то кнежевски град, сједиште жупаније а касније и врбашког дистрикта.',
          'У писаним историјским документима се сједиште жупе Врбас — Врбашки град, изричито спомиње 1293. године. Он се спомиње и као краљевски град. Врбашки град се помиње 1321. године када је издата повеља под градом Врбасом и 1398. године када је под овим градом боравио мађарско-аустријски краљ и будући њемачки цар Сигисмунд.'
        ]
      },

      {
        title: 'Аустроугарски период',
        images: [
          {
            name: 'Gradiska1910.webp',
            caption: 'Градишка у вријеме Аустроугарске'
          },
          {
            name: 'GradiskaSrpskiSoko.webp',
            caption: 'Чланови Српског Сокола у Градишци'
          }
        ],
        texts: [
          'Од 1878. до 1918. године, Градишка је у саставу Аустроугарске. У овом периоду град мијења свој изглед, те од оријенталне касабе добија обрисе модерног европског града. Гради се градска вјећница (Rathaus), хотел „Кајзер“ (Kaiser), католичка црква Светог Рока и многобројне зграде у класицистичком стилу. Тврђава Бербир изграђена у турско доба, која је већ тада била у рушевном стању, у поптуности је срушена. Уређује се обала Саве и гради се насип који ће град заштити од поплава. Изграђена је рјечна лука у коју су пристајали путнички и теретни бродови. Такође, ово је и период значајног досељавања Нијемаца из пренасељених дијелова Њемачке у села у околини Градишке. Осим Нијемаца доселио се и велики број Италијана и Пољака који и данас живе у Градишци. С друге стране, са новом власти и променама нису се могли носити муслимани (данас Бошњаци) те је знатан број њих напустио Градишку и одселио се у Малу Азију.',
          'Аустроугарске власти граде пругу Градишка — Горњи Подградци којом се експлоатисала шума са Козаре. У Подградцима је изграђена пилана која је запошљавала велики број људи. Са друге стране њемачки досељеници у Лијевче пољу знатно су унаприједили пољопривредну производњу.',
          'На културном плану, у Градишци се оснива Соколско друштво. Вођство Српског Сокола у Градишци дошло је прво на мисао да се соколство пресади у широке народне слојеве помоћу побратимства. Први велики слет побратима и сокола одржан је у Градишци на Видовдан 1911. године. Поворка од 600 дицсиплинованих побратима ишла је са соколском музиком на челу. Слет је привукао велике масе народа не само из босанскоградишког среза, него и из срезова сусједне Славоније.',
          'До Првог свјетског рата у граду су постојале само основне школе. По завршетку школовања основци из Градишке и околине морали су ићи у Бања Луку или у друге градове Аустроугарске Монархије, најчешће у Нову Градишку.'
        ]
      },

      {
        title: 'Период Краљевине Југославије',
        images: [
          {
            name: 'GradiskaTrgNikolePasica.webp',
            caption: 'Трг Николе Пашића 1930-их'
          },
          {
            name: 'Gradiskahram1940.webp',
            caption: 'Православни храм у Градишци 1940. године'
          }
        ],
        texts: [
          'Од 1918. до 1941. године, Градишка се налазила у саставу Краљевине Југославије. Град је био сједиште босанскоградишког среза који је осим територије данашње општине обухватао и дијелове који данас припадају србачкој општини (Стапари). Након подјеле Југославије на бановине, Градишка је ушла у састав Врбаске бановине. Између два светска рата у граду је изграђен монументални православни храм (срушен око Видовдана 1941. године) од стране усташа, друмски мост преко Саве (1939), болница, соколски дом, зграде прве и друге основне школе и други објекти. Градско подручје имало је 64 улице. Ниједна улица није била асфалтирана, а само је мали број њих имао изграђене бетонске пјешачке плочнике. У граду је постојало нешто мало канализационе мреже, али без градског водовода.',
          'Смјештена у изразито аграрном крају, Градишка је била централно насеље које је становништву пружало административне, трговачке, занатске, основне просветне и здравствене услуге. Индустријска производња у граду била је скромна, два парна млина, двије пилане и неколико млинова на Сави. Све остале привредне активности су биле, углавном, занатство, трговина и угоститељство. Електрична централа почела је са радом 1925. године и производила је струју за потребе града: градску расвјету, среске и општинске управне зграде, бановинске институције, пословне и стамбене објекте. Из Градишке електране се снабдијевао струјом и Државни казнени завод у Старој Градишци. Нижа реална гимназија у Градишци основана је 1921. године. То је била прва средња школа у граду која је ђацима са положеном малом матуром омогућавала да се запошљавају као чиновници или да настављају школовање у већим градовима. Народна библиотека у Градишци 1931. године имала је књижни фонд од 600 књига.',
          'У Босанској Градишки црква је разрушена око Видовдана 1941. године. Прво је минирана, али пошто није одмах срушена, позван је грађевинар Фрањо Соку, који је као Чех одбијао да руши цркву, али је приморан. Рушење је почело од крста на звонари. „Било је већ вече, а рушење је морало престати. Сутрадан се наставља, али крст са звонаре пада и убија на месту грађевинара Соку. Рушење је настављено док цркве није нестало са лица земље“.'
        ]
      },

      {
        title: 'СФР Југославија',
        images: [
          {
            name: 'Gradiska1970.webp',
            caption: 'Градишка 1970-их'
          }
        ],
        texts: [
          'Крај Другог свјетског рата народ овог краја дочекао је на згариштима и пустим огњиштима. На ратиштима и концентрационим логорима у Јасеновцу, Старој Градишки, Јастребарском и другим мучилиштима животе је изгубило око 13.000 Срба са подручја општине, а међу њима око 4.500 дјеце старости до 15 година. Послије рата уследила је обнова опустошеног града и општине. У Градишци се граде бројне фабрике, школе, вртићи, стамбени и други објекти. Захваљујући плодном Лијевче пољу и развијеној индустрији у граду општина Босанска Градишка налазила се на листи развијенијих општина СР Босне и Херцеговине у вријеме СФРЈ. Од седамдесетих година 20. вијека велики број људи одлази на привремени рад у земље Западне Европе, првенствено у Њемачку и Аустрију (гастарбајтери).'
        ]
      },

      {
        title: 'Грађански рат у Југославији',
        images: [
          {
            name: 'Gradiska1980.webp',
            caption: 'Улица маршала Тита 1980-их'
          }
        ],
        texts: [
          'Распадом СФР Југославије и проглашењем независности Хрватске, Градишка се 1991. године нашла на првој линији фронта. У раним јутарњим часовима, 8. августа 1992. године непријатељ је из правца Хрватске покушао напад на приградско насеље Бок Јанковац при чему је животе изгубило шеснаест бораца ВРС.[4] Агресор је након жестоке битке побјеђен и протјеран преко Саве, а непријатељска војна јединица „Бербирска бојна“ имала је велике губитке од преко 250 погинулих.',
          'Првог маја 1995. године, током операције Бљесак, хрватска војска је топовима бомбардовала Градишку. Следећег дана, 2. маја 1995. године непријатељски авион којим је управљао Рудолф Перешин бомбардовао је центар града, при чему су страдала недужна дјеца и цивили. Истог дана његов авион је оборен изнад Градишке од стране ВРС, а злочинац Перешин је изгубио живот. За око 20.000 прогнаних Срба из Западне Славоније мост на Сави у Градишци био је „мост спаса“.'
        ]
      },

      {
        title: 'Савремено доба',
        images: [
          {
            name: 'Gradiskapogled.webp',
            caption: 'Поглед на град'
          },
          {
            name: 'GradiskaSenjak.webp',
            caption: 'Насеље Сењак у Градишци'
          }
        ],
        texts: [
          'Потписивањем Дејтонског споразума град и општина Градишка у цјелини су остали у саставу Републике Српске. Иако недалеко од прве линије одбране током ратних година Градишка је била поштеђена од већих ратних разарања. У одбрамбено-отаџбинском рату, од 1991. до 1995. године, са подручја општине, погинуло је 300 бораца Војске Републике Српске. У њихову част 2015. године у Спомен парку подигнуто је централно спомен обиљежје.',
          'Са престанком рата у граду је знатно измјењена етничка структура одласком муслимана (Бошњака) и Хрвата, тако да данас Срби чине апсолутну већину. Данас је Градишка погранични град између Републике Српске (БиХ) и Републике Хрватске и шести град по величини у Српској. У самом центру града налази се један од најпрометнијих граничних прелаза.',
          'До 2. априла 1993. године (Сл. гласник РС 3/93) званичан назив градског насеља и истоимене општине био је Босанска Градишка.',
          'Од 1995. године у Градишци је урађено много по питању инфраструктуре. Савски мост, тешко оштећен на крају рата, био је изван функције. Средствима Европске уније обновљен је и пуштен у промет 10. маја 2000. године. До те године Градишку је са Хрватском повезивао понтонски мост постављен 1996. године. У граду је изграђен велики број стамбених и пословних објеката, асфалтиране су све улице а изграђене су и нове саобраћајнице. Проширена је канализациона мрежа и у приградским насељима, а градска вода доступна је и у најудаљенијим селима општине.',
          'Здравствени центар у Градишци који обухвата општу болницу, дом здравља и апотекарску установу пружа здравствене услуге за преко 100.000 становника, не само са подручја градишке општине већ и са подручја србачке, дубичке и лакташке општине. Нова зграда опште болнице свечано је отворена у априлу 2011. године. Ступањем на снагу Закона о граду Градишка и доношењем одлука на ванредној сједници локалног парламента 05.04.2019.г. Градишка и званично постаје град.'
        ]
      },
    ],

    galleryFolders: [
      {
        id: 1,
        name: 'Gallery 1',
        transName: 'Галерија-1',
        images: [
          {
            name: 'example-1.png'
          },
          {
            name: 'example-2.png'
          },
          {
            name: 'example-3.png'
          },
          {
            name: 'example-4.png'
          },
          {
            name: 'example-5.png'
          }
        ]
      },
      {
        id: 2,
        name: 'Gallery 2',
        transName: 'Галерија-2',
        images: [
          {
            name: 'example-1.png'
          },
          {
            name: 'example-2.png'
          },
          {
            name: 'example-3.png'
          }
        ]
      }
    ],

    mediaVideos: [
      {
        urlPath: 'https://www.youtube.com/embed/jZkIcoVY0vY',
        title: 'Православни вјерници прослављају Васкрс',
        datetime: 1556359517000
      },
      {
        urlPath: 'https://www.youtube.com/embed/IiN0ZFNCii4',
        title: 'Врбица окупила бројне вјернике',
        datetime: 1555749467000
      },
      {
        urlPath: 'https://www.youtube.com/embed/2VK5k3YS_9w',
        title: 'Бадњак у Градишци',
        datetime: 1546801414000
      },
      {
        urlPath: 'https://www.youtube.com/embed/dEIrgtsHTKg',
        title: 'Епископ бањалучки Јефрем служио Свету литургију у Градишци',
        datetime: 1542481414000
      },
      {
        urlPath: 'https://www.youtube.com/embed/0ud2GX5gKgM',
        title: 'У току обнова цркве у Градишци',
        datetime: 1525457014000
      },
      {
        urlPath: 'https://www.youtube.com/embed/-nAtRK0hVGs',
        title: 'Прослављена крсна слава храма у Градишци',
        datetime: 1539626614000
      },
      {
        urlPath: 'https://www.youtube.com/embed/aDNy0rxIwAE',
        title: 'У суботу епископ бањалучки Јефрем у градишком храму',
        datetime: 1542135814000
      },
      {
        urlPath: 'https://www.youtube.com/embed/Utme2ZDjKq0',
        title: 'У Градишци прослављена Врбица',
        datetime: 1522519414000
      },
      {
        urlPath: 'https://www.youtube.com/embed/-WkhXygdGJ8',
        title: 'Крсна слава општине Градишка',
        datetime: 1537553014000
      },
      {
        urlPath: 'https://www.youtube.com/embed/3iprGNWroRc',
        title: 'Реконструкција градишког храма и пратећих објеката',
        datetime: 1539194614000
      },
      {
        urlPath: 'https://www.youtube.com/embed/_y-5hTrKDjk',
        title: '150 година Храма Покрова Пресвете Богородице',
        datetime: 1482951814000
      },
      {
        urlPath: 'https://www.youtube.com/embed/tPZcKOLoAkA',
        title: 'На прољеће почиње обнова Храма Покрова Пресвете Богородице',
        datetime: 1511463814000
      },
    ]
  },

  mutations: {

  },

  actions: {

  },

  getters: {
    mainNavigationLinks: state => {
      var navigationLinks = state.navLinks.filter((navLink, index) => {
        return index < 5; //Return first 5 nav links
      });

      return navigationLinks;
    },

    asideNavigationLinks: state => {
      var asideLinks = state.navLinks.filter((navLink, index) => {
        return index > 4; //Return last 3 nav links for aside
      });

      return asideLinks;
    }
  }
})
